## SQLite

In [2]:
! ls -ltrh test.sqlite

-rw-r--r--  1 davidchiu  staff     0B Sep 24 09:26 test.sqlite

In [5]:
import sqlite3 as lite
con = lite.connect('test.sqlite')
cur = con.cursor()
cur.execute('SELECT SQLITE_VERSION();')
data = cur.fetchone()
print(data)
con.close()

('3.24.0',)

In [6]:
with lite.connect('test.sqlite') as con:
    cur = con.cursor()
    cur.execute('SELECT SQLITE_VERSION();')
    data = cur.fetchone()
    print(data)

('3.24.0',)

In [7]:
import sqlite3 as lite 
with lite.connect("test.sqlite") as con: 
    cur = con.cursor() 
    cur.execute("DROP TABLE IF EXISTS PhoneAddress") 
    cur.execute("CREATE TABLE PhoneAddress(phone CHAR(10) PRIMARY KEY, address TEXT, name TEXT unique, age INT NOT NULL)") 
    cur.execute("INSERT INTO PhoneAddress VALUES('0912173381','United State','Jhon Doe',53)") 
    cur.execute("INSERT INTO PhoneAddress VALUES('0928375018','Tokyo Japan','MuMu Cat',6)") 
    cur.execute("INSERT INTO PhoneAddress VALUES('0957209108','Taipei','Richard',29)") 
    cur.execute("SELECT phone,address FROM PhoneAddress") 
    data = cur.fetchall() 
    for rec in data:
        print(rec)
        #print(rec[0], rec[1])

('0912173381', 'United State')
('0928375018', 'Tokyo Japan')
('0957209108', 'Taipei')

In [8]:
import sqlite3 as lite 
with lite.connect("test.sqlite") as con: 
    cur = con.cursor() 
    cur.execute("DROP TABLE IF EXISTS PhoneAddress") 
    cur.execute("CREATE TABLE PhoneAddress(phone CHAR(10) PRIMARY KEY, address TEXT, name TEXT unique, age INT NOT NULL)") 
    cur.execute("INSERT INTO PhoneAddress VALUES('0912173381','United State','Jhon Doe',53)") 
    cur.execute("INSERT INTO PhoneAddress VALUES('0928375018','Tokyo Japan','MuMu Cat',6)") 
    cur.execute("INSERT INTO PhoneAddress VALUES('0957209108','Taipei','Richard',29)") 
    cur.execute("SELECT phone,address FROM PhoneAddress") 
    data = cur.fetchone() 
    print(data)
    data2 = cur.fetchall() 
    print(data2)
        #print(rec[0], rec[1])

('0912173381', 'United State')
[('0928375018', 'Tokyo Japan'), ('0957209108', 'Taipei')]

In [9]:
import pandas
employee = [{'name':'Mary', 'age':23 , 'gender': 'F'},
            {'name':'John', 'age':33 , 'gender': 'M'}]
df = pandas.DataFrame(employee)
df

   age gender  name
0   23      F  Mary
1   33      M  John

In [11]:
with lite.connect('test.sqlite') as db:
    df.to_sql('employee', con = db, if_exists='replace' )

In [22]:
with lite.connect('test.sqlite') as db:
    df2 = pandas.read_sql_query('SELECT * FROM employee;', con = db, 
                                index_col= 'index')

In [23]:
df2

       age gender  name
index
0       23      F  Mary
1       33      M  John

## MySQL

In [ ]:
import pymysql

conn = pymysql.connect(host='127.0.0.1', \
    user='david',password='1qaz@WSX', \
    db='test',charset='utf8', \
    use_unicode=True)

cur = conn.cursor()
sql = "SELECT * FROM test"
cur.execute(sql)

data = cur.fetchall()
print(data)

conn.close()

In [ ]:
import psycopg2

conn = psycopg2.connect(database='test')

cur = conn.cursor()
sql = "SELECT * FROM test"
cur.execute(sql)

data = cur.fetchall()
print(data)

conn.close()